'''
题目描述
在无限的整数序列 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, ...中找到第 n 个数字。
注意:
n 是正数且在32为整形范围内 ( n < 231)。
示例 1:
输入:
3
输出:
3
示例 2:
输入:
11
输出:
0
说明:
第11个数字在序列 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, ... 里是0，它是10的一部分。
'''


n=int(input())

if 1<=n<=9:
    print(n)
elif 10<=n<=9+90*2:
    n-=9
    if n%2==0:
        n/=2
        x=9+n
        print(str(x)[1])
    else:
        n=int(n/2)+1
        x=9+n
        print(str(x)[0])
else:   # 三位数
    n-=189
    if n%3==0:
        n/=3
        x=99+n
        print(str(x)[2])
    elif n%3==1:
        n=int(n/3)+1
        x=99+n
        print(str(x)[0])
    else:
        n=int(n/3)+1
        x=99+n
        print(str(x)[1])

























