'''
题目描述:
给定一个仅包含 0 和 1 的二维二进制矩阵，找出只包含 1 的最大矩形，并返回其面积。

输入描述:
一个仅包含 0 和 1 的二维二进制矩阵

输出描述:
找出只包含 1 的最大矩形，并返回其面积。

测试样例:
样例1: 输入-输出
[
  ["1","0","1","0","0"],
  ["1","0","1","1","1"],
  ["1","1","1","1","1"],
  ["1","0","0","1","0"]
]

6
'''
'''
对每一行都求出每个元素对应的高度，这个高度就是对应的连续1的长度，然后对每一行都更新一次最大矩形面积
'''
matrix=[["1","0","1","0","0"],
        ["1","0","1","1","1"],
        ["1","1","1","1","1"],
        ["1","0","0","1","0"]]

dimension=matrix.copy()

for i in range(0,len(matrix)):
    for j in range(0,len(matrix[0])):
        if matrix[i][j]=="1":
            if i==0:






